<template>
  <div>
    <v-Head :backgrounds="this.$route.meta.background" :classFixed="this.$route.meta.classFixed" :classShadow="this.$route.meta.boxShadow"></v-Head>
    <section class="footer-content">
      <section class="footer-content">
        <article class="footer-block">
          <div class="registration-terms-container">
            <div class="panel panel-default">
              <div class="panel-title">
                注册条款
              </div>
              <div class="panel-body">
                <div id="registration-terms">
                  <h3>迈科技注册条款</h3>
                  <p>迈科技（以下简称“本网站”）依据《迈科技服务协议》（以下简称“本协议”）的规定提供服务，本协议具有合同效力。用户注册时，请您认真阅读本协议，审阅并接受或不接受本协议（未成年人应在法定监护人陪同下审阅）。</p><p>
                  若您已经注册为本网站用户，即表示您已充分阅读、理解并同意自己与本网站订立本协议，且您自愿受本协议的条款约束。本网站有权随时变更本协议并在本网站上予以公告。经修订的条款一经在本网站的公布后，立即自动生效。如您不同意相关变更，必须停止使用本网站。本协议内容包括协议正文及所有迈科技已经发布的各类规则。所有规则为本协议不可分割的一部分，与本协议正文具有同等法律效力。一旦您继续使用本网站，则表示您已接受并自愿遵守经修订后的条款。</p><pre>1. 用户的权利和义务
    1. 用户在使用本网站服务时，必须遵守中华人民共和国相关法律法规的规定，用户应同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为∶
        1. 上载、展示、张贴、传播或以其他方式传送含有下列内容之一的信息：
            1. 反对宪法所确定的基本原则的；
            2. 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
            3. 损害国家荣誉和利益的；
            4. 煽动民族仇恨、民族歧视、破坏民族团结的；
            5. 破坏国家宗教政策，宣扬邪教和封建迷信的；
            6. 散布谣言，扰乱社会秩序，破坏社会稳定的；
            7. 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
            8. 侮辱或者诽谤他人，侵害他人合法权利的；
            9. 含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其他道德上令人反感的内容；
            10. 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其他内容的；
        2. 不得为任何非法目的而使用网络服务系统；
        3. 不利用迈科技服务从事以下活动：
            1. 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；
            2. 未经允许，对计算机信息网络功能进行删除、修改或者增加的；
            3. 未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；
            4. 故意制作、传播计算机病毒等破坏性程序的；
            5. 其他危害计算机信息网络安全的行为；
    2. 用户须自行负责自己的用户账号和密码，且须对在用户账号密码下发生的所有活动（包括但不限于发布需求信息、网上点击同意各类协议、规则、参与需求投标等）承担责任。用户有权根据需要更改登录和账户提现密码。因用户的过错导致的任何损失由用户自行承担，该过错包括但不限于：不按照交易提示操作，未及时进行交易操作，遗忘或泄漏密码，密码被他人破解，您使用的计算机被他人侵入；
    3. 用户有义务确保在本网站上发布的需求信息真实、准确，无误导性；
    4. 用户在本网站网上交易过程中如与其他用户因交易产生纠纷，可以请求本网站从中予以协调处理。用户如发现其他用户有违法或违反本协议的行为，可以向本网站举报；
    5. 用户应当自行承担因交易产生或取得的相关费用，并依法纳税；
    6. 未经本网站书面允许，用户不得将本网站的任何资料以及在交易平台上所展示的任何信息作商业性利用（包括但不限于以复制、修改、翻译等形式制作衍生作品、分发或公开展示）；
    7. 用户不得使用以下方式登录网站或破坏网站所提供的服务：
        1. 以任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件或其他自动方式访问或登录本网站；
        2. 通过任何方式对本公司内部结构造成或可能造成不合理或不合比例的重大负荷的行为；
        3. 通过任何方式干扰或试图干扰网站的正常工作或网站上进行的任何活动。
    8. 用户同意接收来自本网站的信息，包括但不限于活动信息、交易信息、促销信息等。
2. 迈科技的权利和义务
    1. 本网站有义务在现有技术水平的基础上努力确保整个网上交流平台的正常运行，尽力避免服务中断或将中断时间限制在最短时间内，保证用户网上交流活动的顺利进行；
    2. 本网站有义务对用户在注册使用本网站信息平台中所遇到的与交易或注册有关的问题及反映的情况及时作出回复；
    3. 本网站有权对用户的注册资料进行审查，对存在任何问题或怀疑的注册资料，本网站有权发出通知询问用户并要求用户做出解释、改正；
    4. 用户因在本网站网上交易与其他用户产生纠纷的，用户将纠纷告知本网站，或本网站知悉纠纷情况的，经审核后，本网站有权通过电子邮件及电话联系向纠纷双方了解纠纷情况，并将所了解的情况通过电子邮件互相通知对方；用户通过司法机关依照法定程序要求本网站提供相关资料，本网站将积极配合并提供有关资料；
    5. 因网上信息平台的特殊性，本网站没有义务对所有用户的交易行为以及与交易有关的其他事项进行事先审查，但如发生以下情形，本网站有权无需征得用户的同意限制用户的活动、向用户核实有关资料、发出警告通知、暂时中止、无限期中止及拒绝向该用户提供服务：
        1. 用户违反本协议或因被提及而纳入本协议的相关规则；
        2. 存在用户或其他第三方通知本网站，认为某个用户或具体交易事项存在违法或不当行为，并提供相关证据，而本网站无法联系到该用户核证或验证该用户向本网站提供的任何资料；
        3. 存在用户或其他第三方通知本网站，认为某个用户或具体交易事项存在违法或不当行为，并提供相关证据。本网站以普通非专业交易者的知识水平标准对相关内容进行判别，可以明显认为这些内容或行为可能对本网站用户或本网站造成财务损失或法律责任。
    6. 根据国家法律、法规、行政规章规定、本协议的内容和本网站所掌握的事实依据，可以认定该用户存在违法或违反本协议行为以及在本网站交易平台上的其他不当行为，本网站有权无需征得用户的同意在本网站交易平台及所在网站上以网络发布形式公布该用户的违法行为，并有权随时作出删除相关信息、终止服务提供等处理；
    7. 本网站依据本协议及相关规则，可以冻结、使用、先行赔付、退款、处置用户缴存并冻结在本网站账户内的资金。被封号的用户如果账户中有资金，在扣除用户不正当收入后，用户可申请提现；
    8. 本网站有权在不通知用户的前提下，删除或采取其他限制性措施处理下列信息：包括但不限于以规避费用为目的；以炒作信用为目的；存在欺诈等恶意或虚假内容；存在恶意竞价或其他试图扰乱正常交易秩序因素；违反公共利益或可能严重损害本网站和其他用户合法利益。
3. 本网站的责任范围
    1. 本网站不能随时预见到任何技术上的问题或其他困难。该等困难可能会导致数据损失或其他服务中断。本网站是在现有技术基础上提供的服务。本网站不保证以下事项∶
        1. 本网站将符合所有用户的要求；
        2. 本网站不受干扰、能够及时提供、安全可靠或免于出错；
        3. 本服务使用权的取得结果是正确或可靠的。
    2. 是否经由本网站下载或取得任何资料，由用户自行考虑、衡量并且自负风险，因下载任何资料而导致用户电脑系统的任何损坏或资料流失，用户应负完全责任。希望用户在使用本网站时，小心谨慎并运用常识；
    3. 用户经由本网站取得的建议和资讯，无论其形式或表现，绝不构成本协议未明示规定的任何保证；
    4. 基于以下原因而造成的利润、商誉、使用、资料损失或其他无形损失，本网站不承担任何直接、间接、附带、特别、衍生性或惩罚性赔偿（即使本网站已被告知前款赔偿的可能性）：
        1. 本网站的使用或无法使用；
        2. 用户的传输或资料遭到未获授权的存取或变更；
        3. 本网站中任何第三方之声明或行为；
        4. 本网站在服务交易中为用户提供交易机会，推荐交易方；
        5. 本网站其他相关事宜。
    5. 本网站只是为用户提供一个服务交易的平台，对于用户所发布的需求的合法性、真实性及其品质，以及用户履行交易的能力等，本网站一律不负任何担保责任；
    6. 本网站提供与其他互联网上的网站或资源的链接，用户可能会因此连结至其他运营商经营的网站，但不表示本网站与这些运营商有任何关系。其他运营商经营的网站均由各经营者自行负责，不属于本网站控制及负责范围之内。对于存在或来源于此类网站或资源的任何内容、广告、物品或其他资料，本网站亦不予保证或负责。因使用或依赖任何此类网站或资源发布的或经由此类网站或资源获得的任何内容、物品或服务所产生的任何损害或损失，本网站不负任何直接或间接的责任。
    7. 在本网站发布的一切信息由发布者独自制作、提供、发布，并独立承担一切后果和相关的法律责任，发布者确保公布资料绝对、及时、准确、完整，不得从事违法活动，迈科技就此类项目不承担任何法律责任，包括不承担除自身以外其他发布者发布不实信息造成的直接或间接损失和任何责任。
4. 知识产权
    1. 本网站及本网站所使用的任何相关软件、程序、内容，包括但不限于作品、图片、档案、资料、网站构架、网站版面的安排、网页设计、经由本网站或广告商向用户呈现的广告或资讯，均由本网站或其他权利人依法享有相应的知识产权，包括但不限于著作权、商标权、专利权或其他专属权利等，受到相关法律的保护。未经本网站或权利人明示授权，用户保证不修改、出租、出借、出售、散布本网站及本网站所使用的上述任何资料和资源，或根据上述资料和资源制作成任何种类产品；
    2. 本网站授予用户不可转移及非专属的使用权，使用户可以通过单机计算机使用本网站的目标代码（以下简称"软件"），但用户不得且不得允许任何第三方复制、修改、创作衍生作品、进行还原工程、反向组译，或以其他方式破译或试图破译源代码，或出售、转让"软件"或对"软件"进行再授权，或以其他方式移转" 软件"之任何权利。用户同意不以任何方式修改"软件"，或使用修改后的"软件"；
    3. 用户不得经由非本网站所提供的界面使用本网站。
5. 隐私权
    1. 信息使用：
        1. 本网站不会向任何人出售或出借用户的个人或法人信息，除非事先得到用户得许可；
        2. 本网站亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播用户的个人或法人信息。任何用户如从事上述活动，一经发现，本网站有权立即终止与该用户的服务协议，查封其账号。
    2. 信息披露：用户的个人或法人信息将在下述情况下部分或全部被披露：
        1. 经用户同意，向第三方披露；
        2. 若用户是合法的知识产权使用权人并提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；
        3. 根据法律的有关规定，或者行政、司法机关的要求，向第三方或者行政、司法机关披露；
        4. 若用户出现违反中国有关法律或者网站规定的情况，需要向第三方披露；
        5. 为提供你所要求的产品和服务，而必须和第三方分享用户的个人或法人信息；
        6. 其他本网站根据法律或者网站规定认为合适的披露。
    3. 信息安全：
        1. 在使用本网站服务进行网上交易时，请用户妥善保护自己的个人或法人信息，仅在必要的情形下向他人提供；
        2. 如果用户发现自己的个人或法人信息泄密，请用户立即联络本网站客服，以便我们采取相应措施。
6. 不可抗力 因不可抗力或者其他意外事件，使得本协议的履行不可能、不必要或者无意义的，双方均不承担责任。本合同所称之不可抗力意指不能预见、不能避免并不能克服的客观情况，包括但不限于战争、台风、水灾、火灾、雷击或地震、罢工、暴动、法定疾病、黑客攻击、网络病毒、电信部门技术管制、政府行为或任何其他自然或人为造成的灾难等客观情况。
7. 迈科技对本协议包括基于本服务协议制定的各项规则拥有最终解释权。
</pre>
                </div>
              </div>
            </div></div>
        </article>
      </section>
    </section>
  </div>
</template>

<script>
  import oneHead from '@/components/oneHead/index.vue'
  export default {
    name: "registration",
    components:{
      "v-Head":oneHead
    }
  }
</script>

<style lang="less">
  .footer-content{
    display: flex;
    width: 100%;
    .footer-block{
      flex: 9;
      padding: 16px 40px;
      .panel-default{
        border: 1px solid #eee;
        background-color: #fff;
        border-radius: 4px;
        box-shadow: 0 1px 1px rgba(0,0,0,.05);
        margin: 0 auto;
        padding-top: 85px;
        max-width: 1240px;
        width: 100%;
        .panel-title{
          padding: 20px;
          font-size: 20px;
          background-color: #f4f8fb
        }
        .panel-body{
          padding: 20px;
          h3{
            font-size: 24px;
            margin-top: 20px;
            margin-bottom: 10px;
          }
          p{
            margin: 0 0 10px;
            color: #666;
            font-size: 16px;
            letter-spacing: 1px;
          }
          pre{
            display: block;
            padding: 9.5px;
            margin: 0 0 10px;
            word-break: break-all;
            border-radius: 2px;
            white-space: pre-wrap;
            word-wrap: break-word;
            font-family: inherit;
            font-size: 14px;
            background-color: transparent;
            border: 0;
            line-height: 24px;
            overflow: hidden;
          }
        }
      }
    }
  }
</style>
